llloooolll/LOLI3-RX8-STC8G1K08/LOLI3-RX8-A10.5.c
//#include<reg51.h>  有了STC8Gxx.h就不需要了
#include<intrins.h>
#include<STC8Gxx.h>
#define u8 unsigned char
#define u16 unsigned int
#define	 u32 unsigned long
/**************************************************************************/
/*
时间：2020年7月4日

修改者：北纬30°@qq156557548

主要功能：
          1.适配STC8G1K08-20PIN，共8个输出通道
          2.将对频方式更改为按键对频，按住按键通电开机即可对频
          3.使用了内部基准源，回传电压比以前精确很多

存在问题：
          1.CH7无法使用PWM输出模式，而且调到PWM模式后会导致CH3无法使用
       （可能没什么人会用第7通道PWM但还是注意为好）
          2.PPM、S.BUS未测试，示波器观察波形没有问题

备注：
          水平所限，实在惭愧，未解决的问题还有待各位大神解决。
          本程序由"萝丽三代6通接送机A10.5源码"修改得来，继承其开源属性，
      仅小范围修改了部分寄存器地址以及算法。
          还请大家多多支持萝丽，开源不易。
*/
/**************************************************************************/
//引脚定义
//POWER_ADC=P1^3电池电压检测在P1.3脚
sbit RC=P1^2;   //对频按键
sbit LED=P1^0;	//定义指示灯
sbit EXT=P1^1;  //扩展脚位
sbit CH1=P3^7;	//定义8个通道输出
sbit CH2=P3^6;
sbit CH3=P3^5;
sbit CH4=P3^4;
sbit CH5=P3^3;
sbit CH6=P3^2;
sbit CH7=P3^1;
sbit CH8=P3^0;

sbit IRQ=P1^4;//定义无线模块的管脚
sbit MDO=P1^5;
sbit MDI=P1^6;
sbit SCK=P1^7;
sbit CSN=P5^4;
sbit CE=P5^5;

/**************************************************************************/

u8 code random[100]= {4,1,3,2,2,1,0,0,2,2,2,3,4,1,2,1,4,3,3,4, //随机跳频序列
                      2,0,2,2,3,1,2,3,2,2,2,4,2,4,0,3,4,2,3,1,
                      0,3,1,3,3,0,2,0,4,3,3,3,3,3,4,1,1,4,3,0,
                      1,0,3,2,3,2,3,3,4,4,1,3,0,0,3,1,3,3,3,0,
                      3,3,4,1,2,4,1,3,0,1,3,4,4,3,2,3,1,2,3,3
                     };
//数据保存
bit Data_change;
u8 xdata TEMP_DATA[50];

//无线通信
u8 rx[11];		//接收的11字节数据
u8 tx[11];
u8 m;
u8 hopping_turn,hopping_num,hopping_count;
u8 xdata address[5];
u8 code address_0[5]= {'L','O','V','E','!'}; //使用LOVE作为对频暗语
u8 hopping[5]= {10,35,60,85,110};
bit first,restar;
bit connecting,lose;
bit jump_1,jump_2,jump_mode;
u8 NRF_error=0;
u8 TX_power=3;
//通道输出
u16 xdata timer1=0,timer2=0,timer3=0,timer4=0,timer5=0;
u8 xdata rx_num=0,receive=0;
u8 xdata Light_LED=0;
u16 xdata out_control_data[8]= {511,511,80,511,511,511,511,511};
u16 CH_data[8]= {0,1024,0,1024,0,1024};
u16 data buff[8];
u16 temp1,temp2;
u8 t_output;

//电压检测
u8 t_adc;
u16 adc1,adc2;
u32 idata last_adc1,last_adc2;
u16 voltage_bec,voltage_total;
u16 *BGV;

//PPM
u8 t_PPMout;
u8 T_h,T_l;
bit PPM_OUT;
bit CH1_SW,CH2_SW,CH3_SW,CH4_SW,CH5_SW,CH6_SW,CH7_SW,CH8_SW;
bit CH1_PWM,CH2_PWM,CH7_PWM;

//SBUS
bit SBUS;
u8 t_sbus;
u8 xdata Sbus_buff[25],Sbus_tx[25];
u16 xdata Sbus_data[8];

/**************************************************************************/
//延时函数
void Delay1ms()		//@12.000MHz
{
	unsigned char i, j;

	i = 16;
	j = 147;
	do
	{
		while (--j);
	} while (--i);
}

void delay_ms(u16 i)
{
    while(i--)
        Delay1ms();
}

/**************************************************************************/
//ROM存储
u8 EEPROM_read(u8 address_H,u16 address_L)	//读数据
{
    IAP_CMD=0x01;
    if(address_L>255)
    {
        IAP_ADDRH=address_H+1;
        IAP_ADDRL=address_L-255;
    }
    else
    {
        IAP_ADDRH=address_H;
        IAP_ADDRL=address_L;
    }

    IAP_TRIG=0x5a;
    IAP_TRIG=0xa5;
    _nop_();
    return IAP_DATA;
}

void EEPROM_write(u8 address_H,u16 address_L,u8 byte)	//写入数据
{
    IAP_CMD=0x02;
    IAP_DATA=byte;
    if(address_L>255)
    {
        IAP_ADDRH=address_H+1;
        IAP_ADDRL=address_L-255;
    }
    else
    {
        IAP_ADDRH=address_H;
        IAP_ADDRL=address_L;
    }

    IAP_TRIG=0x5a;
    IAP_TRIG=0xa5;
    _nop_();
}

void EEPROM_clean(u8 address_H)	//擦除数据
{
    IAP_CMD=0x03;
    IAP_ADDRH=address_H;
    IAP_ADDRL=0;
    IAP_TRIG=0x5a;
    IAP_TRIG=0xa5;
    _nop_();
	  _nop_();
}

u8 EEPROM_test(u8 address_H)
{
    IAP_CONTR=0x83;

    EEPROM_clean(address_H);
    EEPROM_write(address_H,0,0x88);
    if(EEPROM_read(address_H,0)==0x88)
    {
        EEPROM_clean(address_H);
        EEPROM_write(address_H,0,0x55);
        if(EEPROM_read(address_H,0)==0x55)
        {
            return 1;
        }
    }

    return 0;
}



void DATA_read()
{
    u8 i;
    u16 sum=0,sum_read;

    IAP_CONTR=0x83;
    for(i=0; i<40; i++)
    {
        TEMP_DATA[i]=EEPROM_read(0,i);
        sum+=TEMP_DATA[i];
    }

    sum_read=EEPROM_read(0,40);//读校验和
    sum_read<<=8;
    sum_read+=EEPROM_read(0,41);

    if(TEMP_DATA[0]!=0xab||sum!=sum_read)//比较校验和
    {
        first=1;
    }
    else
    {
        hopping[0]=TEMP_DATA[1];
        hopping[1]=TEMP_DATA[2];
        hopping[2]=TEMP_DATA[3];
        hopping[3]=TEMP_DATA[4];
        hopping[4]=TEMP_DATA[5];
        address[0]=TEMP_DATA[6];
        address[1]=TEMP_DATA[7];
        address[2]=TEMP_DATA[8];
        address[3]=TEMP_DATA[9];
        address[4]=TEMP_DATA[10];

        out_control_data[0]=TEMP_DATA[11];
        out_control_data[0]<<=8;
        out_control_data[0]+=TEMP_DATA[12];
        out_control_data[1]=TEMP_DATA[13];
        out_control_data[1]<<=8;
        out_control_data[1]+=TEMP_DATA[14];
        out_control_data[2]=TEMP_DATA[15];
        out_control_data[2]<<=8;
        out_control_data[2]+=TEMP_DATA[16];
        out_control_data[3]=TEMP_DATA[17];
        out_control_data[3]<<=8;
        out_control_data[3]+=TEMP_DATA[18];
        out_control_data[4]=TEMP_DATA[19];
        out_control_data[4]<<=8;
        out_control_data[4]+=TEMP_DATA[20];
        out_control_data[5]=TEMP_DATA[21];
        out_control_data[5]<<=8;
        out_control_data[5]+=TEMP_DATA[22];
        out_control_data[6]=TEMP_DATA[23];
        out_control_data[6]<<=8;
        out_control_data[6]+=TEMP_DATA[24];
        out_control_data[7]=TEMP_DATA[25];
        out_control_data[7]<<=8;
        out_control_data[7]+=TEMP_DATA[26];

        PPM_OUT=TEMP_DATA[27];
        CH1_PWM=TEMP_DATA[28];
        CH2_PWM=TEMP_DATA[29];
        CH7_PWM=TEMP_DATA[30];
        CH1_SW=TEMP_DATA[31];
        CH2_SW=TEMP_DATA[32];
        CH3_SW=TEMP_DATA[33];
        CH4_SW=TEMP_DATA[34];
        CH5_SW=TEMP_DATA[35];
        CH6_SW=TEMP_DATA[36];
        CH7_SW=TEMP_DATA[37];
        CH8_SW=TEMP_DATA[38];
        SBUS=TEMP_DATA[39];
    }

    IAP_CONTR=0;
}

