llloooolll/LOLI3-RX8-STC8G1K08/LOLI3-RX8-A10.5.c
void DATA_save()
{
    u8 i;
    u16 sum;

    TEMP_DATA[0]=0xab;

    TEMP_DATA[1]=hopping[0];	//修改目标模型数据
    TEMP_DATA[2]=hopping[1];
    TEMP_DATA[3]=hopping[2];
    TEMP_DATA[4]=hopping[3];
    TEMP_DATA[5]=hopping[4];
    TEMP_DATA[6]=address[0];	//修改目标模型数据
    TEMP_DATA[7]=address[1];
    TEMP_DATA[8]=address[2];
    TEMP_DATA[9]=address[3];
    TEMP_DATA[10]=address[4];

    TEMP_DATA[11]=out_control_data[0]>>8;
    TEMP_DATA[12]=out_control_data[0];
    TEMP_DATA[13]=out_control_data[1]>>8;
    TEMP_DATA[14]=out_control_data[1];
    TEMP_DATA[15]=out_control_data[2]>>8;
    TEMP_DATA[16]=out_control_data[2];
    TEMP_DATA[17]=out_control_data[3]>>8;
    TEMP_DATA[18]=out_control_data[3];
    TEMP_DATA[19]=out_control_data[4]>>8;
    TEMP_DATA[20]=out_control_data[4];
    TEMP_DATA[21]=out_control_data[5]>>8;
    TEMP_DATA[22]=out_control_data[5];
    TEMP_DATA[23]=out_control_data[6]>>8;
    TEMP_DATA[24]=out_control_data[6];
    TEMP_DATA[25]=out_control_data[7]>>8;
    TEMP_DATA[26]=out_control_data[7];

    TEMP_DATA[27]=PPM_OUT;
    TEMP_DATA[28]=CH1_PWM;
    TEMP_DATA[29]=CH2_PWM;
    TEMP_DATA[30]=CH7_PWM;
    TEMP_DATA[31]=CH1_SW;
    TEMP_DATA[32]=CH2_SW;
    TEMP_DATA[33]=CH3_SW;
    TEMP_DATA[34]=CH4_SW;
    TEMP_DATA[35]=CH5_SW;
    TEMP_DATA[36]=CH6_SW;
    TEMP_DATA[37]=CH7_SW;
    TEMP_DATA[38]=CH8_SW;
    TEMP_DATA[39]=SBUS;

    sum=0;
    for(i=0; i<40; i++)
    {
        sum+=TEMP_DATA[i];
    }
		
    TEMP_DATA[40]=sum>>8;//写入校验和
    TEMP_DATA[41]=sum;

    IAP_CONTR=0x83;
    EEPROM_clean(0);

    for(i=0; i<42; i++)
    {
        EEPROM_write(0,i,TEMP_DATA[i]);
    }

    IAP_CONTR=0;
}

/**************************************************************************/
//NRF24L01
u8 SPI(u8 byte)
{
    u8 i;
    for(i=0; i<8; i++)
    {
        MDI=(byte&0x80);
			_nop_();
        SCK=1;
        byte<<=1;
        byte|=MDO;
			_nop_();
        SCK=0;	
    }
    return byte;
}

void REG_write(u8 address,u8 command)
{
    CSN=0;
    SPI(0x20+address);
    SPI(command);
    CSN=1;
}

void FIFO_write(u8 DATA_OUT[],u8 lengh)
{
    u8 i;
    CSN=0;
    SPI(0xa0);
    for(i=0; i<lengh; i++)
        SPI(DATA_OUT[i]);
    CSN=1;
}

void FIFO_read(u8 DATA_IN[],u8 lengh)		//读取接收数据缓冲区
{
    u8 i;
    CSN=0;
    SPI(0x61);	//读取命令
    for(i=0; i<lengh; i++)
        DATA_IN[i]=SPI(0);
    CSN=1;
}

void TX_address(u8 DATA_IN[])
{
    CSN=0;
    SPI(0x20+0x10);
    SPI(DATA_IN[0]);
    SPI(DATA_IN[1]);
    SPI(DATA_IN[2]);
    SPI(DATA_IN[3]);
    SPI(DATA_IN[4]);
    CSN=1;
}

void RX_address(u8 DATA_IN[])
{
    CSN=0;
    SPI(0x20+0x0a);
    SPI(DATA_IN[0]);
    SPI(DATA_IN[1]);
    SPI(DATA_IN[2]);
    SPI(DATA_IN[3]);
    SPI(DATA_IN[4]);
    CSN=1;
}

void RX_mode()
{
    CE=0;
    REG_write(0x00,0x3b); //CRC,8 bit,Power on,RX
    CE=1;
}

void TX_mode()
{
    CE=0;
    REG_write(0x00,0x0a);
    CE=1;
}

void  NRF_power(u8 P)				//发射功率设置 250k
{
    CE=0;
    if(P==3)REG_write(0x06,0x27);		  //0db 修正之前注释错误
    else if(P==2)REG_write(0x06,0x25);	  //-6db
    else if(P==1)REG_write(0x06,0x23);	  //-12db
    else if(P==0)REG_write(0x06,0x21);    //-18db
    CE=1;
}

void NRF_size(u8 l)
{
    CE=0;
    REG_write(0x11,l);
    CE=1;
}

void NRF_channel(u8 c)
{
    CE=0;
    REG_write(0x05,c);
    CE=1;
}

void NRF_init()
{
    CE=0;
    SCK=0;
    REG_write(0x01,0x00); //禁止 自动应答
    REG_write(0x02,0x01); //允许 P0信道
    REG_write(0x04,0x00); //禁止 自动重发
    RX_mode(); 		//REG_write(0x1d,0x01);
    NRF_channel(66);
    NRF_power(TX_power);
    NRF_size(11);
    RX_address(address);
    TX_address(address);
}

void NRF_test()	  //无线模块终极测试
{
    u8 reset_err=0;
    CE=0;
    SCK=0;
    CSN=0;

    if(SPI(0x20)!=0x0e)reset_err=1;
      
		
    SPI(0x0a);
    CSN=1;
    CSN=0;
    SPI(0x00);

    if(SPI(0x00)!=0x0a)NRF_error|=0x02;				//MOSI bad
	
    CSN=1;
    REG_write(0x01,0x00);
    REG_write(0x04,0x00);
    REG_write(0x11,1);

    FIFO_write(tx,1);
    CE=1;

    delay_ms(4);

    CSN=0;

    if(SPI(0x00)!=0x2e)NRF_error|=0x04;             //CE bad
      
    CSN=1;

    if(IRQ)NRF_error|=0x18;	//IRQ bad
    else if(NRF_error&0x04==0)NRF_error|=0x10;		//MISO bad
    CE=1;

    if(reset_err&&NRF_error>1)NRF_error|=0x01;//CSN,CLK bad

    REG_write(0x07,0x20);	//清除TX中断信号
}

void receiver_connect()
{
    u8 t;
    NRF_power(0);
    NRF_channel(33);
    TX_address(address_0);
    RX_address(address_0);
    while(IRQ);
    FIFO_read(rx,11);		//读取接收数据
    CE=0;
    REG_write(0x07,0x40);	//清除无线模块中断信号
    CE=1;
    if(rx[0]==0xa0)
    {
        hopping[0]=rx[1];
        hopping[1]=rx[2];
        hopping[2]=rx[3];
        hopping[3]=rx[4];
        hopping[4]=rx[5];
        address[0]=rx[6];
        address[1]=rx[7];
        address[2]=rx[8];
        address[3]=rx[9];
        address[4]=rx[10];
    }
		
    tx[0]='O',tx[1]='K';
    connecting=1;
		
    while(connecting)
    {
        TX_mode();
        NRF_channel(33);
        TX_address(address_0);
        RX_address(address_0);
        FIFO_write(tx,11);
        Delay1ms();

        RX_mode();
        NRF_channel(hopping[0]);
        TX_address(address);
        RX_address(address);
        while(1)
        {
            Delay1ms();
            if(IRQ==0)
            {
                FIFO_read(rx,11);		//读取接收数据
                CE=0;
                REG_write(0x07,0x40);	//清除无线模块中断信号
                CE=1;
                connecting=0;
                break;
            }
						
            t++;
						
            if(t>100) {
                t=0;
                break;
            }
        }
    }
    DATA_save();
    RX_address(address);
    TX_address(address);
    NRF_power(3);
}

/**************************************************************************/
void data_check(int x,int max,int min)
{
    if(x>max)x=max;
    if(x<min)x=min;
}

void Get_Sbus_data()
{
    Sbus_data[0]=CH_data[0]<<1;
    Sbus_data[1]=CH_data[1]<<1;
    Sbus_data[2]=CH_data[2]<<1;
    Sbus_data[3]=CH_data[3]<<1;
    Sbus_data[4]=CH_data[4]<<1;
    Sbus_data[5]=CH_data[5]<<1;
    Sbus_data[6]=CH_data[6]<<1;
    Sbus_data[7]=CH_data[7]<<1;

    Sbus_buff[1]=Sbus_data[0];//CH1~CH8
    Sbus_buff[2]=Sbus_data[0]>>8;
    Sbus_buff[2]+=Sbus_data[1]<<3;

    Sbus_buff[3]=Sbus_data[1]>>5;
    Sbus_buff[3]+=Sbus_data[2]<<6;

