llloooolll/LOLI3-RX8-STC8G1K08/LOLI3-RX8-A10.5.c
    Sbus_buff[4]=Sbus_data[2]>>2;

    Sbus_buff[5]=Sbus_data[2]>>10;
    Sbus_buff[5]+=Sbus_data[3]<<1;

    Sbus_buff[6]=Sbus_data[3]>>7;
    Sbus_buff[6]+=Sbus_data[4]<<4;

    Sbus_buff[7]=Sbus_data[4]>>4;
    Sbus_buff[7]+=Sbus_data[5]<<7;

    Sbus_buff[8]=Sbus_data[5]>>1;

    Sbus_buff[9]=Sbus_data[5]>>9;
    Sbus_buff[9]+=Sbus_data[6]<<2;

    Sbus_buff[10]=Sbus_data[6]>>6;
    Sbus_buff[10]+=Sbus_data[7]<<5;

    Sbus_buff[11]=Sbus_data[7]>>3;

    Sbus_tx[0]=0x0f;//Star
    Sbus_tx[1]=Sbus_buff[1];//CH1~CH8
    Sbus_tx[2]=Sbus_buff[2];
    Sbus_tx[3]=Sbus_buff[3];
    Sbus_tx[4]=Sbus_buff[4];
    Sbus_tx[5]=Sbus_buff[5];
    Sbus_tx[6]=Sbus_buff[6];
    Sbus_tx[7]=Sbus_buff[7];
    Sbus_tx[8]=Sbus_buff[8];
    Sbus_tx[9]=Sbus_buff[9];
    Sbus_tx[10]=Sbus_buff[10];
    Sbus_tx[11]=Sbus_buff[11];
    Sbus_tx[12]=0;//CH9~CH16
    Sbus_tx[13]=0;
    Sbus_tx[14]=0;
    Sbus_tx[15]=0;
    Sbus_tx[16]=0;
    Sbus_tx[17]=0;
    Sbus_tx[18]=0;
    Sbus_tx[19]=0;
    Sbus_tx[20]=0;
    Sbus_tx[21]=0;
    Sbus_tx[22]=0;
    Sbus_tx[23]=0;//flag
    Sbus_tx[24]=0;//End
}

void Cycle()
{
    timer1++;
    if(timer1>333)			//每秒统计接收到的有效信号，小于20个点亮LED示警，表示信号微弱
    {
        timer1=333;
        rx_num=0;
        Light_LED=2;
    }
    timer2++;
    if(timer2>333)
    {
        timer2=0;
        rx_num=receive;
        receive=0;
    }
    timer3++;
    if(timer3>666)//信号丢失2秒触发失控保护
    {
        timer3=666;
        CH_data[0]=out_control_data[0];
        CH_data[1]=out_control_data[1];
        CH_data[2]=out_control_data[2];
        CH_data[3]=out_control_data[3];
        CH_data[4]=out_control_data[4];
        CH_data[5]=out_control_data[5];
        CH_data[6]=out_control_data[6];
        CH_data[7]=out_control_data[7];

        Get_Sbus_data();
    }
    if(Data_change)
    {
        timer4++;
        if(timer4>333)
        {
            timer4=0;
            Data_change=0;
            DATA_save();
        }
    }

    if(Light_LED==1)
    {
        LED=1;
        timer5++;
        if(timer5>10)
        {
            timer5=0;
            Light_LED=0;
        }
    }
    else if(Light_LED==2)LED=1;
    else LED=0;

    m++;			//两个标志位循环跳频
    if(jump_1==0)
    {
        if(m>7)lose=0,jump_1=1,jump_2=0;	  //未收到信号，开始第一跳
    }
    else
    {
        if(jump_2==0)
        {
            if(m>14)lose=0,jump_2=1;		 //第一跳之后仍无信号，开始第二跳
        }
        else
        {
            if(m>22)m=0,lose=0,jump_1=0;	 //第二跳之后仍无信号，复位重新跳。
        }
    }
		
		
    t_adc++;
    if(t_adc==1)
    {
        adc1=(ADC_RES<<8)|ADC_RESL;
        last_adc1=(adc1/2+last_adc1/2);
			
			  ADC_RES=0;   ////准备下一次ADC检测，结果在下面的t_adc=2
			  ADC_RESL=0;
		  	P1IE=0x08;
        ADC_CONTR=0xc3;
    }
    else if(t_adc==2)
    {
        t_adc=0;
			  adc2=(ADC_RES<<8)|ADC_RESL;
			  last_adc2=(adc2/2+last_adc2/2);
			
				ADC_RES=0;  //准备下一次ADC检测，结果在上面的t_adc=1
			  ADC_RESL=0;
        P1IE=0x00;
        ADC_CONTR=0xcf;
    }
}

/*************************************************************/
//串口通信SBUS
void UartInit(void)		//100000bps@12.000MHz
{
    SCON = 0xD0;		//9位数据,可变波特率
    AUXR |= 0x01;		//串口1选择定时器2为波特率发生器
    AUXR |= 0x04;		//定时器2时钟为Fosc,即1T
    T2L = 0xE2;		//设定定时初值
    T2H = 0xFF;		//设定定时初值
}

void LED_flash(u8 t)
{
    while(t)
    {
        LED=1;
        delay_ms(200);
        LED=0;
        delay_ms(200);
        t--;
    }
}

void initial()
{  
	//设置引脚输出模式
	P3M0=0xff;  //P3脚均为推挽输出
	P3M1=0x00;
	
	P1M0=0x01;  //P10为LED推挽输出，P13为ADC高阻输入，其他均为准双向口
	P1M1=0x08;
    
	P5M0=0x00;  //P5两个脚为准双向口
	P5M1=0x00;
	
	CH1=0;
	CH2=0;
	CH3=0;
	CH4=0;
	CH5=0;
	CH6=0;
	CH7=0;
	CH8=0;
	LED=1;
	delay_ms(600);
	LED=0;
	RC=1;
	EXT=1;
	
	IAP_TPS=0x0c;  //EEPROM擦除等待时间
	
	Delay1ms();
	
	if(RC==0)  //对频按键按下
	{
			delay_ms(50);
			if(RC==0)restar=1;  //需要重新对频
	}
	
	while(1)
	{
		if(EEPROM_test(2))break;  //读写检查，防止低电压无法读写
		else delay_ms(500);
	}
	
	DATA_read();
	data_check(out_control_data[0],1023,0);
	data_check(out_control_data[1],1023,0);
	data_check(out_control_data[2],1023,0);
	data_check(out_control_data[3],1023,0);
	data_check(out_control_data[4],1023,0);
	data_check(out_control_data[5],1023,0);
	data_check(out_control_data[6],1023,0);
	data_check(out_control_data[7],1023,0);
	
	NRF_test();
	
	if(NRF_error)   //模块错误闪灯
	{
		  LED=0;
		  delay_ms(1000);
			LED_flash(5);  //错误闪灯次数
	}
	
	NRF_init();
	
	if(restar)first=1;
	
	if(first)
	{
			receiver_connect();
	}	
}

void main(void)
{
	delay_ms(200);//开机延时以避过电源波动

	initial();//初始化
	BGV=(u16 idata*)0xef;  //读取内部基准电压

	ADC_CONTR=0x80;		 //ADC上电时钟初始化
	ADCTIM=0x3f;
	ADCCFG=0x2f;
	
	P_SW1=0x10;//PWM引脚切换到P3口
	PCA_PWM2=0x03;
	PCA_PWM1=0x03;
	
	if(CH1_PWM)CCAPM2=0x42;
	if(CH2_PWM)CCAPM1=0x42;

	IP=0x02; //T0高优先
	IE=0x82; //允许T0中断

	if(SBUS)
	{
			UartInit();
			CMOD=0x01;//允许PCA中断
			IE2=0;
			CH7=1;
	}
	else
	{
			T2L=0x47,T2H=0xf4;//T2 3ms
			IE2=0x04;//允许T2中断
			CMOD=0;
	}

	TMOD=0x00;	//定时器模式0
	AUXR|=0x10; 	  //打开定时器2
	CCON=0x40;			 //打开PCA定时器

	NRF_channel(hopping[0]);

	while(IRQ);
	TR0=1;
	lose=1;

	while(1)
	{
			while(IRQ&lose);
			if(lose)
			{
					jump_1=0;
					jump_2=0;
					hopping_count=0;//收到有效信号后刷新跳频器
					receive++;
					timer1=0;
					timer3=0;
					m=0;
					if(Light_LED)Light_LED=0;

					FIFO_read(rx,11);		//读取接收数据
					CE=0;
					REG_write(0x07,0x40);	//清除无线模块中断信号
					CE=1;

					TX_mode();
				
					tx[0]=rx_num;  //第一字节为信号强度
				/*
				通过测量内部基准电压来反推单片机电压（实不相瞒我研究了半天才看懂）
				回传电压数值为真实电压的100倍，即voltage_bec=500代表回传电压5.00V
				*/
				  voltage_bec=(int)(1024L**BGV/last_adc1); 
				  voltage_bec/=10;
					tx[1]=voltage_bec>>8;
					tx[2]=voltage_bec;
				/*
				动力电压由单片机电压参考得来，数值同样为真实电压的100倍
				若单片机工作在3.3V，理论可以测量0-9.9V电压，可测2S电池
				若单片机工作在5V，理论可以测量0-15V电压，可测3S电池
				*/
					voltage_total=(long)last_adc2*voltage_bec*3/1024;
					tx[3]=voltage_total>>8;
					tx[4]=voltage_total;
					
					FIFO_write(tx,11);
					Delay1ms();

					RX_mode();

					if(jump_mode)
					{
							jump_mode=0;
							hopping_turn=random[hopping_num];
					}
					hopping_turn++;
					if(hopping_turn>4)hopping_turn=0;
					NRF_channel(hopping[hopping_turn]);

					if(rx[0]==0xa2)
					{
							Light_LED=1;

							if(rx[1]&0x80)
							{
									PPM_OUT=1;
							}
							else
							{
									PPM_OUT=0;
							}

							if(rx[1]&0x40)
							{
									SBUS=1;
							}
							else
							{
									SBUS=0;
							}

