llloooolll/LOLI3-RX8-STC8G1K08/LOLI3-RX8-A10.5.c
							if(SBUS)
							{
									UartInit();
									CMOD=0x01;//允许PCA中断
									IE2=0;
							}
							else
							{
									T2L=0x47,T2H=0xf4;//T2 3ms
									AUXR &= 0xFB;//12T
									IE2=0x04;//允许T2中断
									CMOD=0;
							}

							if(rx[1]&0x08)
							{
									CH1_PWM=1;
									CCAPM2=0x42;
							}
							else
							{
									CH1_PWM=0;
									CCAPM2=0;
							}

							if(rx[1]&0x04)
							{
									CH2_PWM=1;
									CCAPM1=0x42;
							}
							else
							{
									CH2_PWM=0;
									CCAPM1=0;
							}

							if(rx[1]&0x02)
							{
									CH7_PWM=1;
									CCAPM0=0x42;
							}
							else
							{
									CH7_PWM=0;
									CCAPM0=0;
							}

							if(rx[2]&0x80)CH1_SW=1;
							else CH1_SW=0;
							if(rx[2]&0x40)CH2_SW=1;
							else CH2_SW=0;
							if(rx[2]&0x20)CH3_SW=1;
							else CH3_SW=0;
							if(rx[2]&0x10)CH4_SW=1;
							else CH4_SW=0;
							if(rx[2]&0x08)CH5_SW=1;
							else CH5_SW=0;
							if(rx[2]&0x04)CH6_SW=1;
							else CH6_SW=0;
							if(rx[2]&0x02)CH7_SW=1;
							else CH7_SW=0;
							if(rx[2]&0x01)CH8_SW=1;
							else CH8_SW=0;

							Data_change=1;
							timer4=0;
					}
					else if(rx[0]==0xa0)
					{
							Light_LED=1;
							LED=1;

							buff[0]=rx[1];
							buff[0]<<=2;
							buff[0]+=rx[2]>>6;
							buff[1]=rx[2]&0x3f;
							buff[1]<<=4;
							buff[1]+=rx[3]>>4;
							buff[2]=rx[3]&0x0f;
							buff[2]<<=6;
							buff[2]+=rx[4]>>2;
							buff[3]=rx[4]&0x03;
							buff[3]<<=8;
							buff[3]+=rx[5];

							buff[4]=rx[6];
							buff[4]<<=2;
							buff[4]+=rx[7]>>6;
							buff[5]=rx[7]&0x3f;
							buff[5]<<=4;
							buff[5]+=rx[8]>>4;
							buff[6]=rx[8]&0x0f;
							buff[6]<<=6;
							buff[6]+=rx[9]>>2;
							buff[7]=rx[9]&0x03;
							buff[7]<<=8;
							buff[7]+=rx[10];

							data_check(buff[0],1023,0);
							data_check(buff[1],1023,0);
							data_check(buff[2],1023,0);
							data_check(buff[3],1023,0);
							data_check(buff[4],1023,0);
							data_check(buff[5],1023,0);
							data_check(buff[6],1023,0);
							data_check(buff[7],1023,0);

							out_control_data[0]=buff[0];
							out_control_data[1]=buff[1];
							out_control_data[2]=buff[2];
							out_control_data[3]=buff[3];
							out_control_data[4]=buff[4];
							out_control_data[5]=buff[5];
							out_control_data[6]=buff[6];
							out_control_data[7]=buff[7];

							Data_change=1;
							timer4=0;

					}
					else if(rx[0]==0xa1)
					{
							buff[0]=rx[1];
							buff[0]<<=2;
							buff[0]+=rx[2]>>6;
							buff[1]=rx[2]&0x3f;
							buff[1]<<=4;
							buff[1]+=rx[3]>>4;
							buff[2]=rx[3]&0x0f;
							buff[2]<<=6;
							buff[2]+=rx[4]>>2;
							buff[3]=rx[4]&0x03;
							buff[3]<<=8;
							buff[3]+=rx[5];

							buff[4]=rx[6];
							buff[4]<<=2;
							buff[4]+=rx[7]>>6;
							buff[5]=rx[7]&0x3f;
							buff[5]<<=4;
							buff[5]+=rx[8]>>4;
							buff[6]=rx[8]&0x0f;
							buff[6]<<=6;
							buff[6]+=rx[9]>>2;
							buff[7]=rx[9]&0x03;
							buff[7]<<=8;
							buff[7]+=rx[10];

							data_check(buff[0],1023,0);
							data_check(buff[1],1023,0);
							data_check(buff[2],1023,0);
							data_check(buff[3],1023,0);
							data_check(buff[4],1023,0);
							data_check(buff[5],1023,0);
							data_check(buff[6],1023,0);
							data_check(buff[7],1023,0);

							CH_data[0]=buff[0];
							CH_data[1]=buff[1];
							CH_data[2]=buff[2];
							CH_data[3]=buff[3];
							CH_data[4]=buff[4];
							CH_data[5]=buff[5];
							CH_data[6]=buff[6];
							CH_data[7]=buff[7];

							Get_Sbus_data();
					}

			}
			else
			{
					hopping_count++;
					if(hopping_count>5)jump_mode=1;

					if(jump_mode)
					{
							hopping_num++;
							if(hopping_num>99)hopping_num=0;
							NRF_channel(hopping[random[hopping_num]]);
							lose=1;
					}
					else
					{
							hopping_turn++;
							if(hopping_turn>4)hopping_turn=0;
							NRF_channel(hopping[hopping_turn]);
							lose=1;
					}

			}

	}

}


void ET0_isr()interrupt 1		//定时器0用作信号输出
{
    u16 temp;
    if(PPM_OUT)			  //输出8通道PPM，PPM信号总周期20ms，
    {
        //每通道固定0.4ms低电平开始，0.6到1.6ms高电平结束
        t_PPMout++;
        switch(t_PPMout)
        {
        case 1:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[0];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 2:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 3:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[1];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 4:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 5:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[2];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 6:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 7:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[3];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 8:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 9:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[4];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 10:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 11:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[5];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 12:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 13:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[6];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 14:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 15:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            temp=64935-CH_data[7];
            T_l=temp;
            T_h=temp>>8;
            break;
        case 16:
            CH1=0;
            TL0=T_l;
            TH0=T_h;
            break;
        case 17:
            CH1=1;
            TL0=0x70,TH0=0xfe;
            break;
        case 18:
            CH1=0;
            TL0=0xf0,TH0=0xd8;
            t_PPMout=0;
            break;
        }
    }
    else if(SBUS)
    {
        CH7=1;
        if(t_sbus>24)
        {
            t_sbus=0;
        }
        else
        {

            if(TI)TI=0;
            ACC=Sbus_tx[t_sbus];
            TB8=P;
            SBUF=ACC;

            t_sbus++;
        }

        if(t_sbus==25)
        {
            TL0=0xF0;
            TH0=0xD8;//10ms
        }
        else
        {
            TL0=0x88;
            TH0=0xFF;//120us
        }

