llloooolll/LOLI3-RX8-STC8G1K08/LOLI3-RX8-A10.5.c
    }
    else
    {
        t_output++;
        switch(t_output)
        {

        case 1:
            if(CH1_PWM)//输出PWM
            {
                if(CH_data[0]<100)
                {
                    PCA_PWM2=0x03;
                }
                else
                {
                    PCA_PWM2=0x00;
                }
                CCAP2H=255-CH_data[0]/4;
            }
            else
            {
                if(CH1_SW)//输出电平信号
                {
                    if(CH_data[0]<500)CH1=0;
                    else CH1=1;
                }
                else CH1=1;	//输出舵量
            }

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 2:
            if(CH1_PWM==0)
            {
                if(CH1_SW==0)CH1=0;
            }

            temp1=64725-CH_data[1]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 3:
            if(CH2_PWM)
            {
                if(CH_data[1]<100)
                {
                    PCA_PWM1=0x03;
                }
                else
                {
                    PCA_PWM1=0x00;
                }
                CCAP1H=255-CH_data[1]/4;
            }
            else
            {
                if(CH2_SW)
                {
                    if(CH_data[1]<500)CH2=0;
                    else CH2=1;
                }
                else CH2=1;
            }

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 4:
            if(CH2_PWM==0)
            {
                if(CH2_SW==0)CH2=0;
            }

            temp1=64725-CH_data[2]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 5:
            if(CH3_SW)
            {
                if(CH_data[2]<500)CH3=0;
                else CH3=1;
            }
            else CH3=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 6:
            if(CH3_SW==0)CH3=0;

            temp1=64725-CH_data[3]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 7:
            if(CH4_SW)
            {
                if(CH_data[3]<500)CH4=0;
                else CH4=1;
            }
            else CH4=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 8:
            if(CH4_SW==0)CH4=0;

            temp1=64725-CH_data[4]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 9:
            if(CH5_SW)
            {
                if(CH_data[4]<500)CH5=0;
                else CH5=1;
            }
            else CH5=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 10:
            if(CH5_SW==0)CH5=0;

            temp1=64725-CH_data[5]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;


        case 11:
            if(CH6_SW)
            {
                if(CH_data[5]<500)CH6=0;
                else CH6=1;
            }
            else CH6=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 12:
            if(CH6_SW==0)CH6=0;

            temp1=64725-CH_data[6]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 13:
            if(CH7_SW)
            {
                if(CH_data[6]<500)CH7=0;
                else CH7=1;
            }
            else CH7=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 14:
            if(CH7_SW==0)CH7=0;

            temp1=64725-CH_data[7]*27/20;
            TL0=temp1,TH0=temp1>>8;
            break;

        case 15:
            if(CH8_SW)
            {
                if(CH_data[7]<500)CH8=0;
                else CH8=1;
            }
            else CH8=1;

            temp2=128600-temp1;
            TL0=temp2,TH0=temp2>>8;
            break;

        case 16:
            if(CH8_SW==0)CH8=0;

            temp1=64725-CH_data[0]*27/20;
            TL0=temp1,TH0=temp1>>8;
				
            t_output=0;
            break;
        }
    }
}

void PCA_isr()interrupt 7
{
    CL=0x48,CH=0xf4;	  //3ms
    CCON=0x40;

    Cycle();
}

void et2()interrupt 12	//跳频定时器 3ms
{
    Cycle();
}

